#include "derivative.h"      /* derivative-specific definitions */
#include "18B20.h"      


/*************************************************************/
/*                         ÑÓÊ±º¯Êý1                         */
/*************************************************************/
void delay8us(unsigned int n) 
{
    unsigned int i;
    for(i=0;i<n;i++) 
    {
        TFLG1_C0F = 1;              //Çå³ý±êÖ¾Î»
        TC0 = TCNT + 2;             //ÉèÖÃÊä³ö±È½ÏÊ±¼äÎª8us
        while(TFLG1_C0F == 0);      //µÈ´ý£¬Ö±µ½·¢ÉúÊä³ö±È½ÏÊÂ¼þ
    }
}

/*************************************************************/
/*                      ³õÊ¼»¯18B20                          */
/*************************************************************/
void init18b20(void)
{
 DSDDR=1;
 DSO = 1; 
 delay8us(1);
 DSO = 0;          //À­µÍÊý¾ÝÏß£¬¸´Î»×ÜÏß£»
 delay8us(63);     //ÑÓÊ±504us 
 DSO = 1;         //ÌáÉýÊý¾ÝÏß£»
 delay8us(4);     //ÑÓÊ±32us£»
 DSDDR=0;
 while(DSI)       //µÈ´ý´ÓÆ÷¼þÆ÷¼þÓ¦´ðÐÅºÅ£»
 {asm("nop");}
 DSDDR=1;
 delay8us(16);     //ÑÓÊ±128us£» 
 DSO = 1;          //ÌáÉýÊý¾ÝÏß£¬×¼±¸Êý¾Ý´«Êä£»
}

/*************************************************************/
/*                      Ïò18B20Ð´ÈëÊý¾Ý                      */
/*************************************************************/
void WR18b20(byte cmd)
{
    unsigned char k;
    for(k=0;k<8;k++)
    {
        if(cmd & 0x01)  	    //µÍÎ»ÔÚÇ°£»
        {
            DSO = 0;    
            delay8us(1); 
            DSO = 1;          //·¢ËÍÊý¾Ý;
        }                 	
        else 
        {
            DSO = 0;    	       
            delay8us(1);  
        }
        delay8us(8);  		 //ÑÓÊ±64usµÈ´ý´ÓÆ÷¼þ²ÉÑù£»
        DSO = 1;      	   //À­¸ß×ÜÏß
        delay8us(1);      	 
        cmd >>= 1;
    }
}

/*************************************************************/
/*                      ÓÉ18B20¶ÁÈ¡Êý¾Ý                      */
/*************************************************************/
unsigned char RD18b20(void)
{
    unsigned char k;
    unsigned char tmp=0;
    DSO = 1;  
    delay8us(1);          //×¼±¸¶Á£»
    for(k=0;k<8;k++)
    {
      tmp >>= 1;    		 //ÏÈ¶ÁÈ¡µÍÎ»
      DSO = 0;     	     //Read init£»
      delay8us(1);     		
      DSO = 1;      		//±ØÐëÐ´1£¬·ñÔò¶Á³öÀ´µÄ½«ÊÇ²»Ô¤ÆÚµÄÊý¾Ý£»
      asm("nop");asm("nop");asm("nop");			//ÑÓÊ±9us£  
      DSDDR=0;
      asm("nop");
      if(DSI)      	//ÔÚ12us´¦¶ÁÈ¡Êý¾Ý£»
      tmp |= 0x80;
      delay8us(8);
      DSDDR=1;
      DSO = 1;  
      delay8us(1);
        //»Ö¸´One Wire Bus£»
    }
    return tmp; 
}

/*************************************************************/
/*                      ÓÉ18B20¶ÁÈ¡ÎÂ¶È                      */
/*************************************************************/
unsigned int read_T(void)
{  
	 unsigned int t;
	 unsigned char temp[2];
   
   init18b20();
   WR18b20(0xcc);  
   WR18b20(0x44); 
   init18b20();
   WR18b20(0xcc);
   WR18b20(0xbe);
   temp[0]=RD18b20();
   temp[1]=RD18b20();
   init18b20();
   t=(temp[1]<<8)|temp[0];
   return(t); 
 } 


